---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LightingFixtureWattage
source: html/f0981249-1377-ec5c-bc20-44e279ef60c7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LightingFixtureWattage Property

"Wattage Comments"

## Syntax (C#)
```csharp
public static ForgeTypeId LightingFixtureWattage { get; }
```